from src.main import app
import uvicorn

# Запуск сервера
if __name__ == "__main__":
    uvicorn.run(app, host="127.0.0.1", port=8000)

"""
Запуск проекта из папки backend по команде "python app.py"

Структура данных:

    Список словарей для хранения задач
    Глобальный счетчик task_id для индентификаторов
    Схемы формата данных для ввода и вывода (Task, TaskWithID) с защитой от некорректных значений
    Сортировка по дате через преобразование строки в datetime
    Группировка эндпоинтов /tasks в router для удобства и использования в потенциале для других проектов

Улучшения для продакшена:

    Заменить хранение в памяти на базу данных
    Добавить аутентификацию и авторизацию с привязкой задач к пользователям
    Реализовать кэширование для часто запрашиваемых данных
    Написать тесты для всех эндпоинтов
    Контейнезировать приложение через Docker
"""
